# St7SetSRABaseExcitation

Sets the status of the Base Excitation setting for Spectral Response analysis.

long St7SetSRABaseExcitation(long uID, bool Base)

Input Parameters

uID

Strand7 model file ID.

Base

True to include Base Excitation cases.